Revit 2026 API

# FamilyManagerDeleteCurrentType Method

---

Remove the current family type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeleteCurrentType()
```
```vb
Public Sub DeleteCurrentType
```
```cpp
public:
void DeleteCurrentType()
```
```fsharp
member DeleteCurrentType : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when there is only one family type in current document. |

If successfully removed, the first available type will become the current type, otherwise an exception with failure information will be thrown.

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace